template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.senior.com.br">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:CadastrarDa>
         <user>ws.interpenn</user>
         <password>3Ropr=wL</password>
         <encryption></encryption>
         <parameters>
            <!--Optional:-->
            <apeCli>ISMAR DE ARAUJO</apeCli>
            <!--Optional:-->
            <baiCli>CascavelVelho</baiCli>
            <!--Optional:-->
            <cepCli>85818100</cepCli>
            <!--Optional:-->
            <cgcCpf>19495020000109</cgcCpf>
            <!--Optional:-->
            <cidCli>Cascavel</cidCli>
            <!--Optional:-->
            <codCli>55008816</codCli>
            <!--Optional:-->
            <codMun>55008816</codMun>
            <!--Optional:-->
            <codPai>71998</codPai>
            <!--Optional:-->
            <codRtr>1</codRtr>
            <!--Zero or more repetitions:-->
            <contasBancarias>
               <!--Optional:-->
               <cgcCpf>19495020000109</cgcCpf>
               <!--Optional:-->
               <codAge>1332</codAge>
               <!--Optional:-->
               <codBan>13</codBan>
               <!--Optional:-->
               <codTcc>10</codTcc>
               <!--Optional:-->
               <numCta>12322</numCta>
               <!--Optional:-->
               <opeCef>?</opeCef>
            </contasBancarias>
            <!--Optional:-->
            <cplEnd>Complemento end socio</cplEnd>
            <!--Optional:-->
            <datCtr>?</datCtr>
            <!--Optional:-->
            <datFdc>21-04-2000</datFdc>
            <!--Optional:-->
            <datRes>?</datRes>
            <!--Optional:-->
            <detPen>emailContato@email.co</detPen>
            <!--Optional:-->
            <dstOma>N</dstOma>
            <!--Optional:-->
            <emaNfe>emailContato@email.com</emaNfe>
            <!--Optional:-->
            <endCli>Rua Holanda</endCli>
            <!--Optional:-->
            <filVin>10</filVin>
            <!--Optional:-->
            <flowInstanceID>?</flowInstanceID>
            <!--Optional:-->
            <flowName>?</flowName>
            <!--Optional:-->
            <fonCl2>459985850505</fonCl2>
            <!--Optional:-->
            <fonCli>?</fonCli>
            <!--Optional:-->
            <gerCtr>S</gerCtr>
            <!--Optional:-->
            <gprOdt>?</gprOdt>
            <!--Optional:-->
            <horCtr>?</horCtr>
            <!--Optional:-->
            <ideInt>?</ideInt>
            <!--Optional:-->
            <insEst>ISENTO</insEst>
            <!--Optional:-->
            <intNet>emailContato@email.com</intNet>
            <!--Optional:-->
            <nenCli>155</nenCli>
            <!--Optional:-->
            <nomCli>ISMAR DE ARAUJO</nomCli>
            <!--Optional:-->
            <nomOdt>?</nomOdt>
            <!--Optional:-->
            <nomOma>?</nomOma>
            <!--Optional:-->
            <parOdt>N</parOdt>
            <!--Optional:-->
            <penCad>S</penCad>
            <!--Optional:-->
            <regEst>1</regEst>
            <!--Optional:-->
            <sigUfs>PR</sigUfs>
            <!--Zero or more repetitions:-->
            <socios>
               <!--Optional:-->
               <baiSoc>Presidente</baiSoc>
               <!--Optional:-->
               <cepSoc>85818100</cepSoc>
               <!--Optional:-->
               <cidSoc>Cascavel</cidSoc>
               <!--Optional:-->
               <cpfCon>?</cpfCon>
               <!--Optional:-->
               <cplEnd>Casa</cplEnd>
               <!--Optional:-->
               <datExp>21-04-2000</datExp>
               <!--Optional:-->
               <datNsc>21-04-1990</datNsc>
               <!--Optional:-->
               <endSoc>Rua Planalto</endSoc>
               <!--Optional:-->
               <estCiv>Solteiro</estCiv>
               <!--Optional:-->
               <estNsc>PR</estNsc>
               <!--Optional:-->
               <fonCe1>4599999989</fonCe1>
               <!--Optional:-->
               <fonCe2>4530353218</fonCe2>
               <!--Optional:-->
               <fonRes>4530353219</fonRes>
               <!--Optional:-->
               <intNet>socioEmail2@email.com</intNet>
               <!--Optional:-->
               <locNsc>Toledo</locNsc>
               <!--Optional:-->
               <nenSoc>155</nenSoc>
               <!--Optional:-->
               <nomCon>?</nomCon>
               <!--Optional:-->
               <nomCra>?</nomCra>
               <!--Optional:-->
               <nomSoc>Nome do Socio</nomSoc>
               <!--Optional:-->
               <nscCon>?</nscCon>
               <!--Optional:-->
               <numCpf>51541826000</numCpf>
               <!--Optional:-->
               <numRgi>515418260</numRgi>
               <!--Optional:-->
               <orgEmi>SSP-PR</orgEmi>
               <!--Optional:-->
               <paiNsc>Brasileiro</paiNsc>
               <!--Optional:-->
               <posPro>N</posPro>
               <!--Optional:-->
               <quaNeg>N</quaNeg>
               <!--Optional:-->
               <regBem>1</regBem>
               <!--Optional:-->
               <sigUfs>PR</sigUfs>
               <!--Optional:-->
               <tipDoc>?</tipDoc>
               <!--Optional:-->
               <tipSoc>1</tipSoc>
               <!--Optional:-->
               <valPro>?</valPro>
            </socios>
            <!--Optional:-->
            <tipCor>1</tipCor>
            <!--Optional:-->
            <usuCtr>?</usuCtr>
            <!--Optional:-->
            <usuGer>442</usuGer>
         </parameters>
      </ser:CadastrarDa>
   </soapenv:Body>
</soapenv:Envelope>